Repository: waleedmandour/rdat-pwa
Catalog: download/qed_micro_corpus.tmx
Source language: en
Languages: ar

source: I would not want anyone to leave the room thinking that we do not need capable, competent militaries who can create real military effect.
ar: لا أريد لأي شخص أن يغادر الغرفة معتقداً بأننا لا نحتاج قوات مسلحة قادرة و مؤهلة تستطيع أن تخلق تأثير عسكري.

source: What I think this really represents is lack of an A to Z rule set for the world as a whole for processing politically bankrupt states.
ar: في اعتقادي ان هذا مؤشر لفقدان مجموعة من القواعد من الالف إلى الياء موضوعة للعالم ككل للتعامل مع الدول المفلسة سياسيا.

source: It was wonderful to be part of something like that, to see musicians from all over the world come together and work together.
ar: لقد كان من الرائع أن تكون جزءًا من ذلك، أن ترى موسيقيين من جميع أنحاء العالم يجتمعوا ويعملوا سويًة.

source: As a result, this production, which had already sold out, every single person in that 800-seat audience, except for 10 people, made a decision to keep the money.
ar: ونتيجة لذلك، هذا العرض الذي تم بيع تذاكره بالفعل، أي شخص في الحضور البالغ عددهم 800، بإستثناء عشرة أشخاص، أخذ قرار بعد إسترداد المال.

source: Twitter, another example of market insight. Masses of people are more likely to write a 140 characters than a 1000 words.
ar: تويتر مثال آخر على المعرفة السوقية، يفضل عدد كبير من الأشخاص التدوين المصغر على كتابة آلاف الكلمات.

source: Founders sometimes naively believe that they can protect their technology from investors or potential investors by making investors sign a non-disclosure agreement.
ar: يعتقد المؤسسون أحيانًا بسذاجة أنهم يستطيعون حماية أفكارهم من المستثمرين أو المستثمرين المحتملين من خلال إبرام اتفاقيات عدم إفصاح معهم.

source: Now over and over again, people have said, "Let's build bridges," and frankly, I want to do more than that.
ar: الآن مرارا وتكرارا، يقول الناس "دعونا نبني الجسور"، وبصراحة، أريد أن أفعل أكثر من ذلك.

source: I would like to share with you some technology that I brought all the way from the thriving metropolis of Brisbane.
ar: أود أن أطلعكم على بعض التكنولوجيا التي أحضرتها من عاصمة بريزبان المزدهرة.

source: Why do people spend an average of 15 to 30 percent more when they use an ATM card or a credit card as opposed to cash?
ar: لماذا يقضي الناس متوسط 15 ال 30 في المائة اكثر عندما يستخدمون بطاقة الصراف الالي وبطاقتهم الائتمانية على العكس من النقد؟

source: The idea of people-work is what we work with here, and I have to make a bond with my designers when we're creating BMWs.
ar: فكرة الناس-العمل هي التي نتعامل معها هنا, و يجب علي أن أصنع حلقة وصل بين المصممين عندما نصنع سيارات بي أم دبليو.

source: The New Tab page will now display thumbnails of your most recently and frequently visited websites from your Awesome Bar history.
ar: ستعرض الصفحة الجديدة مصغرات للمواقع الأكثر زيارة من تأريخ تصفحك.

source: Basically, we developed numerous mobile apps, every one of them explaining a particular concept in math.
ar: العديد من تطبيقات الجوال، كل واحد منها يشرح مفهوم معين في الرياضيات.

source: The nazi occupation and brutal dictatorships of the 20th century have not been erased from peoples memories.
ar: الإحتلال النازي و الديكتاتوريات الوحشية من القرن العشرين لم تمحى من ذاكرة الناس.

source: One of the best ways of killing mosquitos is not to wait until they fly around like adults and bite people and transmit disease.
ar: واحدة من أفضل الطرق لقتل البعوض هي أن لا ننتظر حتى يطيرو حولنا كبالغين و يلدغو الناس و ينقلو المرض.

source: To test whether or not a sample of microbes can break down cellulose effectively, researchers first grow the microbe in a test tube.
ar: و لاختبار ما إذا كانت عينة الميكروبات تكسر السليلوز بفاعلية، قام الباحثون بتنمية البكتيريا في أنابيب اختبار.

source: Now I had people in Washington last week told me, he said, "The Saudis can produce the oil for five dollars a barrel.
ar: الآن أخبرني أحدهم في واشنطن الأسبوع الماضي، قال، "يستطيع السعوديون إنتاج النفط ب5 دولارات للبرميل.

source: Why do the people of the world live in freedom while the children of Palestine do not know the meaning of freedom or sleep peacefully at night?
ar: لماذا يعيش شعوب العالم أحرارًا بينما لا يعرف أطفال فلسطين معنى الحرية أو ينامون نومًا هنيئًا ليلًا؟

source: For example, we are, in Britain, we're trying to do a digital switchover of the whole population into digital technology.
ar: على سبيل المثال ، نحن -- في بريطانيا ، نحاول القيام بتحول رقمي من مجموع السكان في التكنولوجيا الرقمية على شاشة التلفزيون.

source: This guy once said the significant problems we face today can't be solved at the same level of thinking that we were at when we created them.
ar: قال هذا الشخص مرة أننا لا يمكن أن نحل المشاكل الخطيرة التي نواجهها اليوم بنفس مستوى التفكير الذي كان لدينا عندما سببناها.

source: So, let me ask you something. Are we better off because President Obama fought for health care reform?
ar: لذلك،دعوني اسألكم مره أ خرى هل حالنا أفضل اليوم لأن الرئيس أوباما قاتل من أجل إصلاح نظام الرعاية الصحية؟

source: To figure out the elegant recipes that would take the small subset of the periodic table, and create miracle materials like that cell, is the task of green chemistry.
ar: اكتشاف الوصفات الراقية التي تستخدم الجزء الصغير من الجدول الدوري، وإنشاء مواد معجزة كتلك الخلية، هي وظيفة الكيمياء الصديقة للبيئة.

source: The doctors told me this was almost certainly a type of cancer that is incurable, and that I should expect to live no longer than three to six months.
ar: أخبرني فريق الأطباء أن مرضي عضال لا شفاء منه، وأن أمامي من 3 إلى 6 أشهر لأعيشها.

source: The map of Port au-Prince at the end of 2009 was not all it could be, not as good as the map of California.
ar: هذه خارطة بورت أو برينس في نهاية عام 2009 لم تكن كما يمكن أن تكون، ليست جيدة مثل خارطة كالفورنيا.

source: So I was thinking, can you remove us as creators and try to make the music be the voice and have the animation following it?
ar: لذا كنت أفكر، هل يمكن إزالتنا نحن كمبتدعين ونحاول أن نجعل الموسيقى هي الصوت ونجعل الرسوم المتحركة تتبعها.
